Repository: ilCONDORA/Wireless-Debugging-Devices-Manager
Catalog: lib/l10n/app_*.arb
Languages: it

# addDeviceButton
source: Add Device
it: Aggiungi Dispositivo

source: No Devices Found
it: Nessun dispositivo trovato

# killAdbServerButton
source: Kill Adb Server
it: Termina Server Adb

# infoPageButton
source: Info Page
it: Pagina Informazioni

# buyMeATeaButton
source: Buy Me A Tea
it: Offrimi un Tè

source: No Devices Registered
it: Nessun Dispositivo Registrato

# connectDeviceButton
source: Connect
it: Connetti

# disconnectDeviceButton
source: Disconnect
it: Disconnetti

# runTcpipButton
source: Run Tcpip
it: Esegui Tcpip

# runTcpipDialogTitle
source: New device connection port
it: Nuova porta di connessione del dispositivo

# mirrorScreenButton
source: Mirror Screen
it: Replica Schermo

# completeIpAddressLabel
source: Complete IP Address
it: Indirizzo IP Completo

# editIpAddressTitle
source: Edit IP Address
it: Modifica Indirizzo IP

# customNameLabel
source: Custom Name
it: Nome Personalizzato

# editCustomNameTitle
source: Edit Custom Name
it: Modifica Nome Personalizzato

# cancelButton
source: Cancel
it: Annulla

# saveButton
source: Save
it: Salva

# serialNumberLabel
source: Serial Number
it: Numero di Serie

# modelLabel
source: Model
it: Modello

# manufacturerLabel
source: Manufacturer
it: Produttore

# androidVersionLabel
source: Android Version
it: Versione Android

# couldNotLaunchUrl
source: Could not launch.
it: Impossibile avviare.

# adbServerKilledSuccess
source: Adb server killed successfully.
it: Server Adb terminato con successo.

# adbServerKilledError
source: Cannot kill ADB server.
it: Impossibile terminare il server ADB.

# adbServerUnknownError
source: Unknown error while killing ADB server.
it: Errore sconosciuto durante la terminazione del server ADB.

# getDeviceInformationError
source: There was and error while trying to get information about the device. Maybe you don''t have the right permissions.
it: Si è verificato un errore durante il tentativo di ottenere informazioni sul dispositivo. Forse non hai le autorizzazioni necessarie.

# getConnectedDevicesListError
source: There was and error while trying to get the list of devices.
it: Si è verificato un errore durante il tentativo di ottenere l''elenco dei dispositivi.

# getConnectedDevicesListUnknownError
source: Unknown error while trying to get the list of devices.
it: Errore sconosciuto durante il tentativo di ottenere l''elenco dei dispositivi.

# runTcpipSuccess
source: Successfully ran tcpip on {serialNumber}. New port is -> {tcpipPort}.
it: Tcpip eseguito con successo su {serialNumber}. La nuova porta è -> {tcpipPort}.

# runTcpipError
source: Could not set new port for {serialNumber}. Check if the new port is fine or the device is connected or the serial number is correct and retry from the start.
it: Impossibile impostare la nuova porta per {serialNumber}. Verifica che la nuova porta sia corretta o che il dispositivo sia connesso o che il numero di serie sia corretto e riprova dall''inizio.

# runTcpipUnknownError
source: Unknown error while setting new port for {serialNumber} with 'adb tcpip' command.
it: Errore sconosciuto durante l''impostazione della nuova porta per {serialNumber} con il comando 'adb tcpip'.

# connectToDeviceSuccess
source: Successfully connected to {completeIpAddress}.
it: Connessione riuscita a {completeIpAddress}.

# connectToDeviceAuthError
source: Failed to authenticate to {completeIpAddress}.
it: Autenticazione fallita per {completeIpAddress}.

# connectToDeviceError
source: Could not connect to {completeIpAddress}. Check if the IP address is correct and retry.
it: Impossibile connettersi a {completeIpAddress}. Verifica che l''indirizzo IP sia corretto e riprova.

# connectToDeviceUnknownError
source: Unknown error while connecting to {completeIpAddress} with 'adb connect' command.
it: Errore sconosciuto durante la connessione a {completeIpAddress} con il comando 'adb connect'.

# disconnectFromDeviceSuccess
source: Successfully disconnected from {completeIpAddress}.
it: Disconnessione riuscita da {completeIpAddress}.

# disconnectFromDeviceError
source: Error while disconnecting from {completeIpAddress}. Maybe the device is already disconnected. I will updated the connection status anyways.
it: Errore durante la disconnessione da {completeIpAddress}. Forse il dispositivo è già disconnesso. Aggiornerò comunque lo stato della connessione.

# disconnectFromDeviceUnknownError
source: Unknown error while disconnecting from {completeIpAddress} with 'adb disconnect' command. I will updated the connection status anyways.
it: Errore sconosciuto durante la disconnessione da {completeIpAddress} con il comando 'adb disconnect'. Aggiornerò comunque lo stato della connessione.

# mirrorScreenPathError
source: Couldn''t start the mirroring process. Please check if you have SCRCPY installed and if the path is correct.
it: Impossibile avviare il processo di mirroring. Si prega di verificare se SCRCPY è installato e se il percorso nel PATH è corretto.
